HTML & CSS - Design and Build Websites/010.Introducing CSS/010.000.Notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-31 Sat 22:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ch.10 Introducing CSS</title>
<meta name="author" content="Alfredo Mejia" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../scratch/bulma/bulma.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Ch.10 Introducing CSS</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org851c9f3">Navigation</a></li>
<li><a href="#org8247336">Notes</a>
<ul>
<li><a href="#orgf28b7d1">Section 10.1: Introduction to CSS</a>
<ul>
<li><a href="#org5cc10cd">Section 10.1.1: CSS Rules</a></li>
<li><a href="#orgef088b1">Section 10.1.2: CSS Declaration Rules</a></li>
</ul>
</li>
<li><a href="#org790a5a0">Section 10.2: Using CSS</a>
<ul>
<li><a href="#orgeb6fa61">Section 10.2.1: Using External CSS</a></li>
<li><a href="#org0a72025">Section 10.2.2: Using Internal CSS</a></li>
<li><a href="#org33271a4">Section 10.2.3: Using Inline CSS</a></li>
</ul>
</li>
<li><a href="#org1102000">Section 10.3: CSS Selectors</a></li>
</ul>
</li>
<li><a href="#org00e48f7">Keywords</a></li>
<li><a href="#org0eec462">Questions</a></li>
<li><a href="#org97eaf69">Summary</a></li>
</ul>
</div>
</div>

<div id="outline-container-org851c9f3" class="outline-2">
<h2 id="org851c9f3">Navigation</h2>
<div class="outline-text-2" id="text-org851c9f3">
<p>
<b>Home</b>: HTML &amp; CSS - Design and Build Websites [<a href="../000.Home.html">html</a>] [<a href="../000.Home.html">org</a>] [<a href="https://github.com/alfredo-mejia/notes/tree/main/HTML%20%26%20CSS%20-%20Design%20and%20Build%20Websites">github</a>]
</p>

<p>
<b>Prev</b>: Ch.9 Flash, Video &amp; Audio [<a href="../009.Flash, Video &amp; Audio/009.000.Notes.html">html</a>] [<a href="../009.Flash, Video &amp; Audio/009.000.Notes.html">org</a>] [<a href="https://github.com/alfredo-mejia/notes/tree/main/HTML%20%26%20CSS%20-%20Design%20and%20Build%20Websites/009.Flash%2C%20Video%20%26%20Audio">github</a>]
</p>

<p>
<b>Next</b>: Ch.11 Color [<a href="../011.Color/011.000.Notes.html">html</a>] [<a href="../011.Color/011.000.Notes.html">org</a>] [<a href="https://github.com/alfredo-mejia/notes/tree/main/HTML%20%26%20CSS%20-%20Design%20and%20Build%20Websites/011.Color">github</a>]
</p>
</div>
</div>

<div id="outline-container-org8247336" class="outline-2">
<h2 id="org8247336">Notes</h2>
<div class="outline-text-2" id="text-org8247336">
</div>
<div id="outline-container-orgf28b7d1" class="outline-3">
<h3 id="orgf28b7d1">Section 10.1: Introduction to CSS</h3>
<div class="outline-text-3" id="text-orgf28b7d1">
<ul class="org-ul">
<li>THe key to understanding how CSS works is to imagine that there is an invisible box around every HTML element</li>
<li>Recall what are block level elements and inline level elements: block level elements start on a new line while inline elements flow within the text and do not start on a new line</li>
<li>CSS allows you to create rules that control the way that each individual box and the contets of that box is presented</li>
<li>For example, for elements or "boxes" you can add a border around any of the boxes and specify the width, height, color, style, background color, and more</li>
<li>For text inside a box you can control the typeface (e.g. font which is a specific style of the typeface like Roboto which is the typeface and the font is Roboto Regular or Roboto Thin), size, color, italics, bold, uppercase, lowercase, and more</li>
<li>However there are specific rules in CSS to specifically specify the ways you want to style certain elements</li>
</ul>
</div>

<div id="outline-container-org5cc10cd" class="outline-4">
<h4 id="org5cc10cd">Section 10.1.1: CSS Rules</h4>
<div class="outline-text-4" id="text-org5cc10cd">
<ul class="org-ul">
<li>CSS works by associating rules with HTML elements</li>
<li>What do we mean by that? These rules govern how the content of specified elements should be displayed</li>
<li>A CSS rule contains two parts: a <b>selector</b> and a <b>declaration</b></li>
<li>For example:</li>
</ul>

<div class="org-src-container">
<pre class="src src-css">p {
    font-family: Arial;
}
</pre>
</div>

<ul class="org-ul">
<li>The p is the selector and indicates that all <code>&lt;p&gt;</code> elements should be shown in the Arial typeface</li>
<li>The declaration is the <code>font-family: Arial</code></li>
<li>Selectors indicate which element the rule applies to and the same rule can apply to more than one element if you separate the elemet names with commas like <code>p, h1, div {}</code> (the declaraction will be applied to <code>&lt;p&gt;</code>, <code>&lt;h1&gt;</code>, and <code>&lt;div&gt;</code> elements)</li>
<li>Declarations indicate how the elements referred to in the selector should be styled</li>
</ul>
</div>
</div>

<div id="outline-container-orgef088b1" class="outline-4">
<h4 id="orgef088b1">Section 10.1.2: CSS Declaration Rules</h4>
<div class="outline-text-4" id="text-orgef088b1">
<ul class="org-ul">
<li>Declarations are split into two parts: a property and a value</li>
<li>The property and value are separated by a colon and it ends with a semi-colon</li>
<li>CSS declarations sit inside curly brackets after specifying the selectors</li>
<li>Several <i>properties</i> can be specified in one declaration by separating the property / value pair by a semi-color</li>
<li>Properties indicate the aspects of the element you want to change (e.g. color, font, width, etc.)</li>
<li>Values specify the settings you want to use for the chosen properties (e.g. green for color, Roboto for typeface, etc.)</li>
<li>For example:</li>
</ul>

<div class="org-src-container">
<pre class="src src-css">h1, h2, h3 {
    font-family: Arial;
    color: yellow;
}
</pre>
</div>

<ul class="org-ul">
<li>The example above says for h1, h2, and h3 elements I want the typeface to be Arial and the text color to be yellow</li>
<li>Let's do an <a href="./010.001.First CSS Example/index.html">exmaple with HTML and CSS</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org790a5a0" class="outline-3">
<h3 id="org790a5a0">Section 10.2: Using CSS</h3>
<div class="outline-text-3" id="text-org790a5a0">
</div>
<div id="outline-container-orgeb6fa61" class="outline-4">
<h4 id="orgeb6fa61">Section 10.2.1: Using External CSS</h4>
<div class="outline-text-4" id="text-orgeb6fa61">
<ul class="org-ul">
<li>The <code>&lt;link&gt;</code> element can be used in a HTML document to tell the browser where to find the CSS file to style the page</li>
<li>The <code>&lt;link&gt;</code> element is a self-closing tag and it is inside the <code>&lt;head&gt;</code> element and it should use three attributes:
<ol class="org-ol">
<li><code>href</code>: specifies the path to the CSS file (often placed in a folder called css or styles)</li>
<li><code>type</code>: specifies the type of document being linked to (e.g. <code>text/css</code>)</li>
<li><code>ref</code>: specifies the relationship between the HTML page and the file it is linked to (e.g. <code>stylesheet</code>)</li>
</ol></li>
<li>An HTML page can use more than one CSS style sheet</li>
<li>To do this it could have a <code>&lt;link&gt;</code> element for every CSS file it uses (e.g. one CSS file to control presentation and a second to control the layout)</li>
<li><p>
Here is an example:
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;!DOCTYPE html&gt;
&lt;html&gt;
  &lt;head&gt;
    &lt;title&gt;An Example Using External CSS&lt;/title&gt;
    &lt;link href="css/styles.css" type="text/css" rel="stylesheet" /&gt;
  &lt;/head&gt;
&lt;/html&gt;
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org0a72025" class="outline-4">
<h4 id="org0a72025">Section 10.2.2: Using Internal CSS</h4>
<div class="outline-text-4" id="text-org0a72025">
<ul class="org-ul">
<li>You can use the <code>&lt;style&gt;</code> element which sits inside the <code>&lt;head&gt;</code> element which allows you to include CSS rules within an HTML page by placing them inside the <code>&lt;style&gt;</code> element</li>
<li>The <code>&lt;style&gt;</code> element should use the <code>type</code> attribute to indicate that the styles are specified in CSS (e.g. <code>text/css</code> specifies the style is in CSS)</li>
<li>Although you can use internal CSS with HTML, it is best to use an external CSS style sheet especially when building a site with more than one page</li>
<li>The benefits of using external CSS style sheet are:
<ul class="org-ul">
<li>Same style sheet can be applied to multiple pages instead of repeating them</li>
<li>Keeps the content separate from how the page looks</li>
<li>Can change the style of all pages by modifying only one file</li>
</ul></li>
<li><p>
Here is an example:
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;!DOCTYPE html&gt;
&lt;html&gt;
  &lt;head&gt;
    &lt;title&gt;An Example Using Internal CSS&lt;/title&gt;
    &lt;style type="text/css"&gt;
      body {
        font-family: arial;
      }
    &lt;/style&gt;
  &lt;/head&gt;
&lt;/html&gt;
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org33271a4" class="outline-4">
<h4 id="org33271a4">Section 10.2.3: Using Inline CSS</h4>
<div class="outline-text-4" id="text-org33271a4">
<ul class="org-ul">
<li>Another way to specify CSS are by the <code>style</code> attribute which is avaiable in most of the elements that appear in the body of a page</li>
<li>The CSS rules that appeared within the value of the attribute would only apply to that one element</li>
<li><p>
Here's an example:
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;p style="color:red;"&gt;This is an example&lt;/p&gt;
</pre>
</div></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org1102000" class="outline-3">
<h3 id="org1102000">Section 10.3: CSS Selectors</h3>
<div class="outline-text-3" id="text-org1102000">
<ul class="org-ul">
<li>Recall a CSS rule has one or more selectors and a declaration</li>
<li>The declaration can have one or more properties which specify some CSS property to a HTML element?</li>
<li>What are CSS selectors? CSS selectors are a pattern of elements and other terms to basically tell the browser which HTML elements should be selected to have the CSS property values declared in the declaration of the CSS rule</li>
<li>There are many different types of CSS selectors that allow you to target rules to specific elements in a HTML document</li>
<li>CSS selectors are case sensitive so they must match element names and attribute values exactly (e.g. class names, ids, any other attribute because it can be used to select a HTML element)</li>
<li>There are advanced selectors which allow you to select elements based on attributes and their values</li>
<li>Here are the list of selectors:</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Selector</th>
<th scope="col" class="org-left">Meaning</th>
<th scope="col" class="org-left">Example</th>
<th scope="col" class="org-left">Explanation</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Universal Selector</td>
<td class="org-left">Applies to all elements in the document</td>
<td class="org-left"><code>* {}</code></td>
<td class="org-left">Notice how the "*" indicates all the properties declared in the declaration will be applied to every HTML element declared in the page</td>
</tr>

<tr>
<td class="org-left">Type Selector</td>
<td class="org-left">Applies to HTML elements with the same name</td>
<td class="org-left"><code>h1, h2, h3 {}</code></td>
<td class="org-left">Notice how it will use the names and match it with the HTML elements' names; multiple html elements can be specified all having the same declaration declared instead of repeating the same declaration</td>
</tr>

<tr>
<td class="org-left">Class Selector</td>
<td class="org-left">Matches an element whose <code>class</code> attribute has a value that matches the one specified after the period symbol</td>
<td class="org-left"><code>.note {}</code> or <code>p.note {}</code></td>
<td class="org-left">Notice to use a class selector you must use a period which will apply to HTML elements with that class or you can target HTML elements with that class attribute but the HTML element must be a specific element for the properties to be applied (e.g. <code>p.note</code> specifies only <code>&lt;p&gt;</code> elements whose <code>class</code> attribute has a value of <code>note</code>)</td>
</tr>

<tr>
<td class="org-left">ID Selector</td>
<td class="org-left">Matches an element whose <code>id</code> attribute has a value that matches the one specified after the pound or hash symbol</td>
<td class="org-left"><code>#introduction {}</code></td>
<td class="org-left">Notice to use a id selector you must use the pound symbol and targets a specific HTML element with the same id attribute</td>
</tr>

<tr>
<td class="org-left">Attribute Selector</td>
<td class="org-left">Matches HTML elements with certain attributes</td>
<td class="org-left"><code>a[title]</code> or <code>a[href="example.com"]</code> or <code>p[class~="special"]</code> or <code>div[lang \vert ="zh"]</code></td>
<td class="org-left">Notice the first example will apply the properties to the <code>&lt;a&gt;</code> elements that have an attribute called <code>title</code>, the second example will apply to <code>&lt;a&gt;</code> elements that have the attribute <code>href</code> and the exact value <code>example.com</code>, the third example matches <code>&lt;p&gt;</code> elements whose attribute <code>class</code> has an exact value or contains the value in a space separated list of <code>special</code>, and the fourth example matches with <code>&lt;div&gt;</code> elements with the attribute <code>lang</code> whose value is exactly or begins with <code>zh</code> immediately followed by a hyphen; these are just examples but many combinations can be created using this selector</td>
</tr>

<tr>
<td class="org-left">Pseudo Class &amp; Elements</td>
<td class="org-left">Matches with certain states of an element (pseudo class) or a certain part of the element rather than an element itself (pseudo element)</td>
<td class="org-left"><code>a:hover {}</code> or <code>p::first-line {}</code></td>
<td class="org-left">The properties will be applied to only <code>&lt;a&gt;</code> elements when the element is hovered over by a mouse pointer and the second example indicates the first line inside the <code>&lt;p&gt;</code> element will have the properties applied; these are just examples and there are various pseudo classes and elements</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>


<div id="outline-container-org00e48f7" class="outline-2">
<h2 id="org00e48f7">Keywords</h2>
<div class="outline-text-2" id="text-org00e48f7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Term</th>
<th scope="col" class="org-left">Definition</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org0eec462" class="outline-2">
<h2 id="org0eec462">Questions</h2>
<div class="outline-text-2" id="text-org0eec462">
<ul class="org-ul">
<li><b>Q</b>: Besides CSS files, can <code>&lt;link&gt;</code> elements be used for other purposes? Does it need to be inside the <code>&lt;head&gt;</code> element? Can it be inside other elements?</li>
</ul>
</div>
</div>

<div id="outline-container-org97eaf69" class="outline-2">
<h2 id="org97eaf69">Summary</h2>
</div>
</div>
</body>
</html>
